read_verilog -sv ibsm.v
#read_liberty -lib ./osu018_stdcells.lib #lib
proc
#flatten
synth -auto-top
write_verilog synth_ibsm.v
dfflibmap -liberty ./osu018_stdcells.lib
abc -D 5000 -liberty ./osu018_stdcells.lib
stat -liberty ./osu018_stdcells.lib
write_verilog ibsm_s.v
#show
show -viewer gvedit # for windows user