read_verilog -sv mkreq.v
#read_liberty -lib ../osu018_stdcells.lib #lib
proc
#flatten
synth -auto-top
write_verilog synth_mkreq.v
dfflibmap -liberty ./osu018_stdcells.lib
abc -D 5000 -liberty ./osu018_stdcells.lib
stat -liberty ./osu018_stdcells.lib
write_verilog mkreq_s.v
#show
#show -viewer gvedit # for windows user